vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
  if (currentDirection == "ROS") {
    v_left  = (rosTargetRpmSigned[0] < 0) ? -fabsf(v_left) : fabsf(v_left);
    v_right = (rosTargetRpmSigned[2] < 0) ? -fabsf(v_right) : fabsf(v_right);
  } else {
    if (slew[0].target < 0) v_left  = -fabsf(v_left);
    if (slew[2].target < 0) v_right = -fabsf(v_right);
  }

  if (!isMoving || (fabsf(enc[0].rpm) < 1.0f && fabsf(enc[1].rpm) < 1.0f)) v_left = 0.0f;
  if (!isMoving || (fabsf(enc[2].rpm) < 1.0f && fabsf(enc[3].rpm) < 1.0f)) v_right = 0.0f;

  // Giao thức ODOM chuẩn ROS 2 (m/s) để tương thích ngược
  Serial.printf("ODOM %.3f %.3f\n", v_left, v_right);

  // Giao thức ENC 4 bánh (ticks & dt_ms)
  unsigned int dt_ms = (unsigned int)(dt * 1000.0f + 0.5f);
  Serial.printf("ENC %ld %ld %ld %ld %u\n", enc[0].count, enc[1].count, enc[2].count, enc[3].count, dt_ms);

  updateWheelHealth();
  updatePID(dt);
}

void updateWheelHealth() {
  if (!isMoving) {
    for (int i = 0; i < 4; i++) wHealth[i] = {false, 0};
    return;
  }
  unsigned long now = millis();

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) { wHealth[3] = wHealth[2]; continue; }
#endif
    float rpm = abs(enc[i].rpm);
    int   pwm = abs(slew[i].target);

    // Phát hiện kẹt cứng cơ khí / hỏng encoder
    if (pwm > STALL_PWM_THRESHOLD && rpm < STALL_RPM_THRESHOLD) {
      if (wHealth[i].stallStartTime == 0) wHealth[i].stallStartTime = now;
      if (now - wHealth[i].stallStartTime > STALL_DETECT_MS && !wHealth[i].isStalled) {
        wHealth[i].isStalled = true;
        Serial.printf("[HEALTH] CANH BAO: Banh %d bi KHOA/HONG!\n", i + 1);
      }
    } else {
      wHealth[i].stallStartTime = 0;
      wHealth[i].isStalled = false;
    }
  }
}

// ============================================================
//  8. THUẬT TOÁN PID + TORQUE BOOST + ĐỒNG BỘ 4 BÁNH
// ============================================================
void updatePID(float dt) {
  if (!pidGlobalEnabled || !isMoving) return;

  float actualRPM[4];
  for (int j = 0; j < 4; j++) actualRPM[j] = fabsf(enc[j].rpm);

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) {
      wpid[3].pwmOutput     = wpid[2].pwmOutput;
      wpid[3].prevPwmOutput = wpid[2].prevPwmOutput;
      slew[3].target        = slew[2].target;
      continue;
    }
#endif
    if (!wpid[i].enabled) continue;

    float rpm_act = actualRPM[i];
    float target  = wpid[i].targetRPM;
    bool  isLeft  = (i == 0 || i == 1);

    if (target <= 0.1f) {
      wpid[i].pwmOutput = 0;
      wpid[i].integral = 0;
      wpid[i].lastError = 0;
      wpid[i].filteredDeriv = 0;
      slew[i].target = 0;
      continue;
    }

    // 1. Feedforward có bù ma sát tĩnh (Deadband Friction Offset)
    // Động cơ 775 qua hộp số cần tối thiểu ~36 PWM để thắng ma sát tĩnh.
    // Khi có lệnh chạy, Feedforward cung cấp ngay mức sàn ma sát + thành phần tuyến tính.
    float ff_pwm = 36.0f + (target / 220.0f) * (255.0f - 36.0f);

    // 2. Sai số bám tốc độ mục tiêu
    float track_error = target - rpm_act;
    if (fabsf(track_error) < PID_ERROR_DEADBAND) {
      track_error = 0.0f;
    }

    // 3. Khâu tích phân (Integral) có Anti-Windup chặt chẽ
    wpid[i].integral = constrain(wpid[i].integral + track_error * dt, -30.0f, 30.0f);

    // 4. Khâu vi phân (Derivative) có lọc nhiễu
    float rawDeriv = (track_error - wpid[i].lastError) / dt;
    wpid[i].filteredDeriv = DERIVATIVE_FILTER * rawDeriv + (1.0f - DERIVATIVE_FILTER) * wpid[i].filteredDeriv;
    wpid[i].lastError = track_error;

    // 5. Tính toán PID cơ sở
    float pid_corr = (wpid[i].kp * track_error) + (wpid[i].ki * wpid[i].integral) + (wpid[i].kd * wpid[i].filteredDeriv);

    // 6. Tổng hợp PWM điều khiển hoàn chỉnh (0-255)
    // Loại bỏ hoàn toàn các khâu phi tuyến gây dao động giật cục (torque boost quá đà, ghì hãm ngắt tải)
    int desired = constrain((int)(ff_pwm + pid_corr), 0, 255);

    // Sàn PWM tối thiểu để duy trì lăn bánh khi có lệnh chạy (tránh chết máy do ma sát hộp số 775)
    if (target > 1.0f && desired < 36) {
      desired = 36;
    }

    // Giới hạn biến thiên PWM bất đối xứng (tăng lực dứt khoát, giảm lực an toàn cho nhông)
    int maxChange = (desired > wpid[i].prevPwmOutput) ? MAX_PWM_CHANGE_UP : MAX_PWM_CHANGE_DOWN;
    int delta   = constrain(desired - wpid[i].prevPwmOutput, -maxChange, maxChange);
    wpid[i].pwmOutput     = constrain(wpid[i].prevPwmOutput + delta, 0, 255);
    wpid[i].prevPwmOutput = wpid[i].pwmOutput;

    // Giảm tải cho bánh bị kẹt cứng
    if (wHealth[i].isStalled) {
      wpid[i].pwmOutput = max(0, wpid[i].pwmOutput - 50);
      wpid[i].integral = 0;
    }

    // Xác định chiều quay
    int sign = 0;
    if (currentDirection == "ROS")            sign = (rosTargetRpmSigned[i] >= 0.0f) ? 1 : -1;
    else if (currentDirection == "FORWARD")   sign = 1;
    else if (currentDirection == "BACKWARD")  sign = -1;
    else if (currentDirection == "LEFT")      sign = isLeft ? -1 : 1;
    else if (currentDirection == "RIGHT")     sign = isLeft ? 1 : -1;

    slew[i].target = sign * wpid[i].pwmOutput;
  }
}

// ============================================================
//  9. SLEW RATE LIMITER — KHỞI ĐỘNG MỀM (40 Hz)
// ============================================================
void updateSpeedRamp() {
  unsigned long now = millis();
  if (now - lastRampTime < RAMP_INTERVAL_MS) return;
  lastRampTime = now;

  for (int i = 0; i < 4; i++) {
    float &cur  = slew[i].current;
    int    tgt  = slew[i].target;
    float &step = slew[i].step;

    if (tgt == 0) {
      // Dừng xe mượt mà không khựng giật cơ khí: giảm 10 PWM mỗi 25ms (~150-200ms dừng hẳn)
      step = 10.0f;
    } else {
      // Khi đang chạy trong chế độ ROS: bám sát lệnh PID do wpid đã có giới hạn maxChange chống sốc
      step = 25.0f;
    }

    if (abs((float)tgt - cur) <= step) cur = (float)tgt;
    else if (cur < (float)tgt)         cur += step;
    else                               cur -= step;
  }

  writeSingleDrive(DRV1_RPWM, DRV1_LPWM, CH_DRV1_F, CH_DRV1_R, (int)slew[0].current, INV_DRV1);
  writeSingleDrive(DRV2_RPWM, DRV2_LPWM, CH_DRV2_F, CH_DRV2_R, (int)slew[1].current, INV_DRV2);
  writeSingleDrive(DRV3_RPWM, DRV3_LPWM, CH_DRV3_F, CH_DRV3_R, (int)slew[2].current, INV_DRV3);
  writeSingleDrive(DRV4_RPWM, DRV4_LPWM, CH_DRV4_F, CH_DRV4_R, (int)slew[3].current, INV_DRV4);
}

