vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
// ============================================================
//  10. DỪNG XE & CẬP NHẬT TỐC ĐỘ XE
// ============================================================
void stopMotor(bool emergency) {
  currentDirection = "STOP";

  for (int i = 0; i < 4; i++) {
    slew[i].target = 0;
    wpid[i].targetRPM = 0.0f;
    wpid[i].integral = 0;
    wpid[i].lastError = 0;
    wpid[i].filteredDeriv = 0;
    wpid[i].pwmOutput = 0;
    wpid[i].prevPwmOutput = 0;
    rosTargetRpmSigned[i] = 0.0f;
  }

  if (emergency) {
    for (int i = 0; i < 4; i++) slew[i].current = 0.0f;
    writeAllDrives(0, 0, 0, 0);
    isMoving = false;
    Serial.println("# [ESTOP] DUNG KHAN CAP - NGAT DIEN TUC THI!");
  }
}

void stopMotor() {
  stopMotor(false);
}

void setVehicleSpeed(int spd) {
  currentSpeed = constrain(spd, 0, 255);
  if (currentSpeed == 0) {
    stopMotor(false);
    return;
  }
  globalTargetRPM = (currentSpeed / 255.0f) * 220.0f;
  for (int i = 0; i < 4; i++) {
    wpid[i].targetRPM = globalTargetRPM;
  }
}

// ============================================================
//  11. XỬ LÝ LỆNH SERIAL (LỆNH IP & LỆNH ĐIỀU KHIỂN)
// ============================================================
void handleCommand(String command) {
  command.trim();
  if (command.length() == 0) return;

  // Lệnh kiểm tra IP kết nối từ Serial Monitor: "IP"
  if (command.equalsIgnoreCase("IP")) {
    Serial.println();
    Serial.println("=========================================");
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print  ("  >> IP XE THUC TE : ");
      Serial.println(WiFi.localIP());
      Serial.printf ("  >> WiFi SSID     : %s (RSSI: %d dBm)\n", WiFi.SSID().c_str(), WiFi.RSSI());
    } else {
      Serial.println("  [CHUA CO IP] Xe chua ket noi WiFi!");
      Serial.printf ("  SSID dang cau hinh: '%s'\n", ssid);
    }
    Serial.println("=========================================\n");
    return;
  }

  // Lệnh vận tốc ROS 2: "V <FL> <RL> <FR> <RR>" hoặc "V <L> <R>" (RPM)
  if (command.startsWith("V ") || command.startsWith("v ") || command.startsWith("V\t") || command.startsWith("v\t")) {
    float r[4] = {0.0f, 0.0f, 0.0f, 0.0f};
    int parsed = sscanf(command.c_str() + 2, "%f %f %f %f", &r[0], &r[1], &r[2], &r[3]);
    if (parsed == 2) {
      r[3] = r[1]; // Bánh phải sau = Bánh phải trước
      r[2] = r[1];
      r[1] = r[0]; // Bánh trái sau = Bánh trái trước
      parsed = 4;
    }
    if (parsed == 4) {
      lastRosCmdTime = millis();
      if (fabsf(r[0]) < 0.1f && fabsf(r[1]) < 0.1f && fabsf(r[2]) < 0.1f && fabsf(r[3]) < 0.1f) {
        stopMotor(false);
      } else {
        isMoving = true;
        currentDirection = "ROS";
        for (int i = 0; i < 4; i++) {
          rosTargetRpmSigned[i] = r[i];
          wpid[i].targetRPM = fabsf(r[i]);
          wpid[i].enabled = pidGlobalEnabled;
        }
      }
      return;
    }
  }

  // Lệnh Reset Odometry
  if (command.equalsIgnoreCase("RESET_ODOM") || command.equalsIgnoreCase("ZERO") || command.equalsIgnoreCase("RESET")) {
    for (int i = 0; i < 4; i++) {
      enc[i].count = 0;
      enc[i].distance_m = 0.0f;
      enc[i].lastSpeedCount = 0;
    }
    Serial.println("# [ODOM] Da reset toan bo xung va quang duong ve 0.00m");
    return;
  }

  // Lệnh PID: Luôn giữ PID bật cố định để đảm bảo đồng tốc 4 bánh chính xác
  if (command.equalsIgnoreCase("PID 1") || command.equalsIgnoreCase("PID ON")) {
    pidGlobalEnabled = true;
    for (int i = 0; i < 4; i++) wpid[i].enabled = true;
    Serial.println("# [MODE] PID: ON (Luon bat)");
    return;
  }
  if (command.equalsIgnoreCase("PID 0") || command.equalsIgnoreCase("PID OFF")) {
    // Luôn giữ PID bật theo yêu cầu hệ thống, không cho tắt để bảo vệ cân bằng 4 bánh
    pidGlobalEnabled = true;
    for (int i = 0; i < 4; i++) wpid[i].enabled = true;
    Serial.println("# [MODE] PID: LUON BAT (Locked ON - Khong the tat de giu dong toc)");
    return;
  }

  // Lệnh Dừng xe
  if (command.equalsIgnoreCase("STOP") || command.equalsIgnoreCase("X") || command == " ") {
    stopMotor(false);
    return;
  }
  if (command.equalsIgnoreCase("ESTOP") || command.equalsIgnoreCase("EMERGENCY_STOP")) {
    stopMotor(true);
    return;
  }

  // Lệnh chỉnh tốc độ: "SPEED <val>"
  if (command.startsWith("SPEED ") || command.startsWith("speed ")) {
    int spd = command.substring(6).toInt();
    if (spd > 0) {
      setVehicleSpeed(spd);
      Serial.printf("# [SPEED] Target RPM = %.1f (PWM %d)\n", globalTargetRPM, currentSpeed);
    }
    return;
  }

  // Lệnh test thủ công từ Serial Monitor: F (Tiến), B (Lùi), L (Trái), R (Phải)
  command.toUpperCase();
  if (command == "F" || command == "FORWARD") {
    currentDirection = "FORWARD";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "B" || command == "BACKWARD") {
    currentDirection = "BACKWARD";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "L" || command == "LEFT") {
    currentDirection = "LEFT";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  } else if (command == "R" || command == "RIGHT") {
    currentDirection = "RIGHT";
    isMoving = true;
    for (int i = 0; i < 4; i++) wpid[i].targetRPM = globalTargetRPM;
    return;
  }
}

// ============================================================
//  12. SETUP CẤU HÌNH PHẦN CỨNG & KẾT NỐI WIFI LẤY IP
// ============================================================
void setup() {
  lockAllDriverPins();

  Serial.begin(115200);
  Serial.setTimeout(10);

  pwmSetup(DRV1_RPWM, CH_DRV1_F); pwmSetup(DRV1_LPWM, CH_DRV1_R);
  pwmSetup(DRV2_RPWM, CH_DRV2_F); pwmSetup(DRV2_LPWM, CH_DRV2_R);
  pwmSetup(DRV3_RPWM, CH_DRV3_F); pwmSetup(DRV3_LPWM, CH_DRV3_R);
  pwmSetup(DRV4_RPWM, CH_DRV4_F); pwmSetup(DRV4_LPWM, CH_DRV4_R);
  writeAllDrives(0, 0, 0, 0);

  // Khởi tạo trạng thái ban đầu của 4 Encoder và gắn ngắt Quadrature X4 trên cả 2 pha
  for (int i = 0; i < 4; i++) {
    pinMode(enc[i].pinA, INPUT_PULLUP);
    pinMode(enc[i].pinB, INPUT_PULLUP);
    uint8_t a = digitalRead(enc[i].pinA);
    uint8_t b = digitalRead(enc[i].pinB);
    enc[i].state = (a << 1) | b;
    enc[i].lastEdgeTime = micros();
    wpid[i].enabled = true;
    wpid[i].targetRPM = globalTargetRPM;
  }

