vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
  attachInterrupt(digitalPinToInterrupt(enc[0].pinA), isr_enc0, CHANGE);
  attachInterrupt(digitalPinToInterrupt(enc[0].pinB), isr_enc0, CHANGE);

  attachInterrupt(digitalPinToInterrupt(enc[1].pinA), isr_enc1, CHANGE);
  attachInterrupt(digitalPinToInterrupt(enc[1].pinB), isr_enc1, CHANGE);

  attachInterrupt(digitalPinToInterrupt(enc[2].pinA), isr_enc2, CHANGE);
  attachInterrupt(digitalPinToInterrupt(enc[2].pinB), isr_enc2, CHANGE);

  attachInterrupt(digitalPinToInterrupt(enc[3].pinA), isr_enc3, CHANGE);
  attachInterrupt(digitalPinToInterrupt(enc[3].pinB), isr_enc3, CHANGE);

  Serial.println("\n# =========================================================");
  Serial.println("#   ESP32 4-WHEEL DIFFERENTIAL DRIVE CONTROLLER FOR ROS 2  ");
  Serial.printf ("#   Encoder: %d PPR | Quadrature: X4 -> %d CPR              \n", ENCODER_PPR, ENCODER_CPR);
  Serial.printf ("#   Wheel: %.0fmm | Loop: 20Hz RAW & ODOM                  \n", WHEEL_DIAMETER_M * 1000);
  Serial.println("# =========================================================");

  // Khởi tạo WiFi Station để nhận IP
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.printf("\n# Dang ket noi WiFi '%s' de lay IP...", ssid);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 15) {
    delay(400);
    Serial.print(".");
    attempts++;
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("# =========================================================");
    Serial.println("#  WIFI KET NOI THANH CONG!");
    Serial.print  ("#  >> IP XE THUC TE : ");
    Serial.println(WiFi.localIP());
    Serial.printf ("  >> WiFi SSID     : %s (RSSI: %d dBm)\n", WiFi.SSID().c_str(), WiFi.RSSI());
    Serial.println("#  (Go lenh 'IP' tren Serial Monitor de xem lai bat ky luc nao)");
    Serial.println("# =========================================================");
  } else {
    Serial.println("# [THONG BAO] Chưa ket noi duoc WiFi. Van chay Serial ROS 2 binh thuong.");
  }

  Serial.println("# Ready! Dang truyen RAW count va nhan lenh ROS 2 qua cong Serial...\n");
}

// ============================================================
//  13. VÒNG LẶP CHÍNH (LOOP)
// ============================================================
void loop() {
  // Đọc Serial non-blocking từ Raspberry Pi ROS 2
  while (Serial.available() > 0) {
    char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialRxBuf.length() > 0) {
        handleCommand(serialRxBuf);
        serialRxBuf = "";
      }
    } else {
      if (serialRxBuf.length() < 64) serialRxBuf += c;
    }
  }

  // Khởi động mềm Slew Rate (40 Hz)
  updateSpeedRamp();

  // Dừng xe mượt mà khi lệnh là STOP
  if (currentDirection == "STOP" && isMoving) {
    bool allStopped = true;
    for (int i = 0; i < 4; i++) {
      if (fabsf(slew[i].current) > 2.0f || fabsf(enc[i].rpm) > 1.5f) {
        allStopped = false;
        break;
      }
    }
    if (allStopped) {
      writeAllDrives(0, 0, 0, 0);
      isMoving = false;
    }
  }

  // ROS Watchdog an toàn: Tự ngắt nếu quá 1.5s Raspberry Pi không gửi lệnh
  if (currentDirection == "ROS" && isMoving) {
    if (millis() - lastRosCmdTime > ROS_WATCHDOG_TIMEOUT_MS) {
      stopMotor(false);
      Serial.println("# [WATCHDOG] Pi mat ket noi qua 1500ms -> Ngat xe an toan!");
    }
  }

  // Chu kỳ tính toán tốc độ, lọc 5 tầng và gửi RAW / ODOM / ENC (20 Hz)
  calculateSpeed();

  delay(1);
}
